In [1]:
import numpy as np
import pandas as pd

In [3]:
data = np.random.rand(4, 3)

In [4]:
data

array([[0.35012695, 0.70040997, 0.35230817],
       [0.99410989, 0.37683418, 0.76095906],
       [0.17678445, 0.76010313, 0.63362546],
       [0.22876699, 0.41577707, 0.32954628]])

In [5]:
dataFrame = pd.DataFrame(data)

In [6]:
dataFrame

          0         1         2
0  0.350127  0.700410  0.352308
1  0.994110  0.376834  0.760959
2  0.176784  0.760103  0.633625
3  0.228767  0.415777  0.329546

In [10]:
newDataFrame = pd.DataFrame(data, index=['A', 'B', 'C', 'D'], columns=['Column1', 'Column2', 'Column3'])

In [11]:
newDataFrame

    Column1   Column2   Column3
A  0.350127  0.700410  0.352308
B  0.994110  0.376834  0.760959
C  0.176784  0.760103  0.633625
D  0.228767  0.415777  0.329546

In [12]:
newDataFrame['Column1']

A    0.350127
B    0.994110
C    0.176784
D    0.228767
Name: Column1, dtype: float64

In [13]:
newDataFrame.loc['A']

Column1    0.350127
Column2    0.700410
Column3    0.352308
Name: A, dtype: float64

In [14]:
newDataFrame.iloc[0]

Column1    0.350127
Column2    0.700410
Column3    0.352308
Name: A, dtype: float64

In [15]:
newDataFrame

    Column1   Column2   Column3
A  0.350127  0.700410  0.352308
B  0.994110  0.376834  0.760959
C  0.176784  0.760103  0.633625
D  0.228767  0.415777  0.329546

In [16]:
newDataFrame['Column4'] = newDataFrame['Column1'] + newDataFrame['Column2']

In [17]:
newDataFrame

    Column1   Column2   Column3   Column4
A  0.350127  0.700410  0.352308  1.050537
B  0.994110  0.376834  0.760959  1.370944
C  0.176784  0.760103  0.633625  0.936888
D  0.228767  0.415777  0.329546  0.644544

In [18]:
newDataFrame.drop('Column4', axis=1)

    Column1   Column2   Column3
A  0.350127  0.700410  0.352308
B  0.994110  0.376834  0.760959
C  0.176784  0.760103  0.633625
D  0.228767  0.415777  0.329546

In [19]:
newDataFrame

    Column1   Column2   Column3   Column4
A  0.350127  0.700410  0.352308  1.050537
B  0.994110  0.376834  0.760959  1.370944
C  0.176784  0.760103  0.633625  0.936888
D  0.228767  0.415777  0.329546  0.644544

In [20]:
newDataFrame.drop('Column4', axis=1, inplace=True)

In [21]:
newDataFrame

    Column1   Column2   Column3
A  0.350127  0.700410  0.352308
B  0.994110  0.376834  0.760959
C  0.176784  0.760103  0.633625
D  0.228767  0.415777  0.329546

In [22]:
newDataFrame.reset_index()

  index   Column1   Column2   Column3
0     A  0.350127  0.700410  0.352308
1     B  0.994110  0.376834  0.760959
2     C  0.176784  0.760103  0.633625
3     D  0.228767  0.415777  0.329546

In [23]:
newDataFrame

    Column1   Column2   Column3
A  0.350127  0.700410  0.352308
B  0.994110  0.376834  0.760959
C  0.176784  0.760103  0.633625
D  0.228767  0.415777  0.329546

In [25]:
newIndexList = ['BATU', 'ELİF', 'ALİ', 'ZEYNEL']

In [26]:
newDataFrame['NewIndex'] = newIndxList

In [27]:
newDataFrame

    Column1   Column2   Column3 NewIndex
A  0.350127  0.700410  0.352308     BATU
B  0.994110  0.376834  0.760959     ELİF
C  0.176784  0.760103  0.633625      ALİ
D  0.228767  0.415777  0.329546   ZEYNEL

In [28]:
newDataFrame.set_index('NewIndex')

           Column1   Column2   Column3
NewIndex
BATU      0.350127  0.700410  0.352308
ELİF      0.994110  0.376834  0.760959
ALİ       0.176784  0.760103  0.633625
ZEYNEL    0.228767  0.415777  0.329546

In [29]:
newDataFrame

    Column1   Column2   Column3 NewIndex
A  0.350127  0.700410  0.352308     BATU
B  0.994110  0.376834  0.760959     ELİF
C  0.176784  0.760103  0.633625      ALİ
D  0.228767  0.415777  0.329546   ZEYNEL

In [30]:
newDataFrame.set_index('NewIndex', inplace=True)

In [31]:
newDataFrame

           Column1   Column2   Column3
NewIndex
BATU      0.350127  0.700410  0.352308
ELİF      0.994110  0.376834  0.760959
ALİ       0.176784  0.760103  0.633625
ZEYNEL    0.228767  0.415777  0.329546